tiagodnzz/zeta/esp32/src/main.cpp
// Controlador de servos + olho animado (TFT) para ESP32 (PlatformIO)
// Recebe comandos via Serial (USB) do Raspberry Pi e move os servos
// usando PWM em hardware (LEDC) - sem jitter, independente de carga de CPU.
// O mesmo angulo recebido tambem move a iris/pupila desenhada no TFT.
//
// Protocolo (uma linha por comando, terminada em '\n'):
//   X:<0-180>,Y:<0-180>   -> move os dois servos para os angulos dados
//   OFF                    -> solta o sinal dos dois servos (para de segurar)

#include <Arduino.h>
#include <ESP32Servo.h>
#include <TFT_eSPI.h>
#include "icons.h"

namespace {

constexpr int kPinServoX = 25;
constexpr int kPinServoY = 26;

constexpr int kPulseMinUs = 500;
constexpr int kPulseMaxUs = 2500;

// Tela 1.69" montada deitada; esta orientacao corrige a imagem invertida.
constexpr uint8_t kScreenRotation = 3;
constexpr uint16_t kEyeColor = TFT_CYAN;
constexpr uint16_t kBackgroundColor = TFT_BLACK;
constexpr uint16_t kMouthColor = TFT_CYAN;
constexpr unsigned long kIdleDelayMs = 1800;
constexpr unsigned long kIdleCycleMs = 24000;
constexpr uint16_t kMenuAccentColor = TFT_YELLOW;
constexpr uint8_t kMenuItemCount = 10;
const char* const kMenuLabels[kMenuItemCount] = {"SEGUIR MAO", "SEGUIR ROSTO", "CONTAR DEDOS", "OBJETOS", "DATA E HORA", "DESENHAR", "YOUTUBE", "SPOTIFY", "NAVEGADOR", "SISTEMA"};
constexpr int16_t kMainEyeRadius = 8;
constexpr int16_t kMainEyeGap = 64;
constexpr int16_t kMainMouthWidth = 32;
constexpr int16_t kMainMouthYOffset = 36;
constexpr int16_t kMainMouthHeight = 4;

Servo g_servoX;
Servo g_servoY;
TFT_eSPI g_tft;

String g_inputLine;

int16_t g_leftEyeCenterX = 0;
int16_t g_rightEyeCenterX = 0;
int16_t g_eyeCenterY = 0;
int16_t g_eyeWidth = 0;
int16_t g_eyeHeight = 0;
int16_t g_eyeCornerRadius = 0;
int16_t g_maxOffset = 0;
int16_t g_currentOffsetX = 0;
int16_t g_currentOffsetY = 0;
unsigned long g_lastFaceFrame = 0;
unsigned long g_lastTrackingCommand = 0;
unsigned long g_lastZFrame = 0;
bool g_lastBlinking = false;
int8_t g_idlePhase = -1;
bool g_menuVisible = false;
bool g_modeScreenVisible = false;
bool g_systemScreenVisible = false;
uint8_t g_menuIndex = 0;
float g_systemCpu = 0.0f;
float g_systemMemory = 0.0f;
float g_systemTemperature = 0.0f;
bool g_systemTemperatureValid = false;
String g_statusText = "Pronto";
String g_dialogVisibleText;
unsigned long g_dialogStartedAt = 0;
unsigned long g_lastDialogFaceFrame = 0;
unsigned long g_lastDialogScrollAt = 0;
unsigned long g_dialogFinishedAt = 0;
uint16_t g_dialogScrollOffset = 0;
bool g_dialogSpeaking = false;
bool g_dialogThinking = false;

constexpr int16_t kDialogBubbleY = 170;
constexpr int16_t kDialogBubbleWidth = 250;
constexpr int16_t kDialogBubbleHeight = 58;
constexpr uint8_t kDialogTextSize = 2;
constexpr uint8_t kDialogVisibleChars = 21;
constexpr unsigned long kDialogTypeIntervalMs = 85;
constexpr unsigned long kDialogScrollIntervalMs = 180;
constexpr unsigned long kDialogHoldAfterSpeechMs = 3500;

int16_t dialogBubbleX() {
  return (g_tft.width() - kDialogBubbleWidth) / 2;
}

void drawDialogBubbleFrame(bool clearArea) {
  const int16_t faceCenterX = g_tft.width() / 2;
  const int16_t bubbleTop = kDialogBubbleY;
  const int16_t bubbleX = dialogBubbleX();
  if (clearArea) {
    g_tft.fillRect(bubbleX - 4, kDialogBubbleY - 22,
                   kDialogBubbleWidth + 8, kDialogBubbleHeight + 26,
                   kBackgroundColor);
  }
  g_tft.drawRoundRect(bubbleX, kDialogBubbleY,
                      kDialogBubbleWidth, kDialogBubbleHeight, 10, kEyeColor);
  g_tft.fillTriangle(faceCenterX - 8, bubbleTop + 1,
                     faceCenterX + 8, bubbleTop + 1,
                     faceCenterX, bubbleTop - 18, kBackgroundColor);
  g_tft.drawTriangle(faceCenterX - 8, bubbleTop + 1,
                     faceCenterX + 8, bubbleTop + 1,
                     faceCenterX, bubbleTop - 18, kEyeColor);
}

void drawEyeShape(int16_t centerX, int16_t centerY, uint16_t color, bool blinking) {
  if (blinking) {
    const int16_t radius = g_eyeWidth / 2;
    g_tft.fillCircle(centerX, centerY, radius, color);
    g_tft.fillRect(centerX - radius, centerY - radius, radius * 2 + 1, radius + 1,
                   kBackgroundColor);
    return;
  }
  g_tft.fillCircle(centerX, centerY, g_eyeWidth / 2, color);
}

void drawDialogFace(bool blinking, int16_t speakingMouthWidth = 0,
                    int16_t speakingMouthHeight = kMainMouthHeight) {
  const int16_t eyeCenterY = g_eyeCenterY - 8;
  drawEyeShape(g_leftEyeCenterX, eyeCenterY, kEyeColor, blinking);
  drawEyeShape(g_rightEyeCenterX, eyeCenterY, kEyeColor, blinking);
  const int16_t mouthY = eyeCenterY + kMainMouthYOffset;
  if (speakingMouthWidth > 0) {
    g_tft.drawRoundRect(
        g_tft.width() / 2 - speakingMouthWidth,
        mouthY - speakingMouthHeight / 2,
        speakingMouthWidth * 2, speakingMouthHeight,
        speakingMouthHeight / 2, kMouthColor);
  } else {
    g_tft.fillRoundRect(g_tft.width() / 2 - kMainMouthWidth, mouthY,
                        kMainMouthWidth * 2, kMainMouthHeight, 2, kMouthColor);
  }
}

          void drawDialogText() {
            g_tft.setTextDatum(TL_DATUM);
            g_tft.setTextColor(kMenuAccentColor, kBackgroundColor);
            g_tft.setTextSize(kDialogTextSize);
            const int end = min(
              static_cast<int>(g_dialogVisibleText.length()),
              static_cast<int>(g_dialogScrollOffset) + kDialogVisibleChars);
            g_tft.drawString(
              g_dialogVisibleText.substring(g_dialogScrollOffset, end),
                      dialogBubbleX() + 10, kDialogBubbleY + 20);
          }

void attachIfNeeded() {
  if (!g_servoX.attached()) {
    g_servoX.attach(kPinServoX, kPulseMinUs, kPulseMaxUs);
  }
  if (!g_servoY.attached()) {
    g_servoY.attach(kPinServoY, kPulseMinUs, kPulseMaxUs);
  }
}

void drawSleepingEye(int16_t centerX, int16_t centerY) {
  constexpr int16_t sleepingEyeWidth = 32;
  constexpr int16_t sleepingEyeHeight = 8;
  const int16_t left = centerX - sleepingEyeWidth / 2;
  const int16_t top = centerY - sleepingEyeHeight / 2;
  g_tft.fillRoundRect(left, top, sleepingEyeWidth, sleepingEyeHeight, 3,
                      kEyeColor);
}

