tiagodnzz/zeta/esp32/src/main.cpp
void drawMouth() {
  const int16_t mouthCenterX = g_tft.width() / 2;
  const int16_t mouthY = g_eyeCenterY + kMainMouthYOffset;
  g_tft.fillRoundRect(mouthCenterX - kMainMouthWidth, mouthY,
                      kMainMouthWidth * 2, kMainMouthHeight, 2, kMouthColor);
}

// Rosto ampliado usado como avatar na tela de dialogo.
void drawMiniFace(int16_t centerX, int16_t centerY, bool blinking = false,
                  bool smiling = false, int16_t speakingMouthWidth = 0) {
  const int16_t eyeRadius = 15;
  const int16_t eyeGap = 23;
  if (blinking) {
    g_tft.fillCircle(centerX - eyeGap, centerY, eyeRadius, kEyeColor);
    g_tft.fillCircle(centerX + eyeGap, centerY, eyeRadius, kEyeColor);
    g_tft.fillRect(centerX - eyeGap - eyeRadius, centerY - eyeRadius,
                   eyeRadius * 2 + 1, eyeRadius + 1, kBackgroundColor);
    g_tft.fillRect(centerX + eyeGap - eyeRadius, centerY - eyeRadius,
                   eyeRadius * 2 + 1, eyeRadius + 1, kBackgroundColor);
  } else {
    g_tft.fillCircle(centerX - eyeGap, centerY, eyeRadius, kEyeColor);
    g_tft.fillCircle(centerX + eyeGap, centerY, eyeRadius, kEyeColor);
  }
  if (speakingMouthWidth > 0) {
    const int16_t mouthY = centerY + 8;
    g_tft.drawRoundRect(centerX - speakingMouthWidth, mouthY - 2,
                        speakingMouthWidth * 2, 5, 2, kMouthColor);
    return;
  }
  const int16_t mouthY = centerY + 8;
  for (int16_t x = -22; x <= 22; x += 2) {
    const int16_t y = mouthY - (x * x) / (smiling ? 42 : 62);
    g_tft.drawPixel(centerX + x, y, kMouthColor);
  }
}

const uint16_t* menuIconForIndex(uint8_t index);
void drawGestureIcon(int16_t centerX, int16_t centerY);

void drawMenuIcon(uint8_t index, int16_t centerX, int16_t centerY) {
  if (index == 5) {
    drawGestureIcon(centerX, centerY);
    return;
  }
  const uint16_t* bitmap = menuIconForIndex(index);
  if (bitmap != nullptr) {
    constexpr int16_t iconSize = 40;
    for (int16_t y = 0; y < iconSize; y++) {
      for (int16_t x = 0; x < iconSize; x++) {
        const int16_t sourceX = x * kIconWidth / iconSize;
        const int16_t sourceY = y * kIconHeight / iconSize;
        g_tft.drawPixel(centerX - iconSize / 2 + x,
                        centerY - iconSize / 2 + y,
                        pgm_read_word(&bitmap[sourceY * kIconWidth + sourceX]));
      }
    }
    return;
  }
  if (index == 0) {
    g_tft.drawRoundRect(centerX - 16, centerY - 1, 32, 31, 10, kEyeColor);
    for (int8_t finger = -2; finger <= 2; finger++) {
      const int16_t height = finger == -2 ? 22 : 30;
      g_tft.drawRoundRect(centerX + finger * 11 - 4, centerY - height,
                          8, height + 18, 4, kEyeColor);
    }
    g_tft.drawLine(centerX - 27, centerY + 7, centerX - 14, centerY + 2, kEyeColor);
  } else if (index == 1) {
    g_tft.drawRoundRect(centerX - 35, centerY - 25, 70, 54, 22, kEyeColor);
    g_tft.fillCircle(centerX - 14, centerY - 2, 6, kEyeColor);
    g_tft.fillCircle(centerX + 14, centerY - 2, 6, kEyeColor);
    g_tft.drawLine(centerX - 15, centerY + 14, centerX + 15, centerY + 14, kEyeColor);
  } else if (index == 2) {
    g_tft.drawRoundRect(centerX - 27, centerY + 1, 54, 22, 9, kEyeColor);
    for (int8_t finger = -2; finger <= 2; finger++) {
      const int16_t height = 25 + (finger == 0 ? 9 : 0);
      g_tft.drawRoundRect(centerX + finger * 13 - 5, centerY - height / 2,
                          10, height, 5, kEyeColor);
    }
  } else if (index == 3) {
    g_tft.drawRect(centerX - 30, centerY - 22, 60, 44, kEyeColor);
    g_tft.drawLine(centerX - 22, centerY - 14, centerX - 10, centerY - 14, kEyeColor);
    g_tft.drawLine(centerX - 22, centerY - 14, centerX - 22, centerY - 5, kEyeColor);
    g_tft.drawCircle(centerX + 8, centerY + 3, 13, kEyeColor);
    g_tft.drawLine(centerX + 17, centerY + 12, centerX + 26, centerY + 20, kEyeColor);
  } else {
    g_tft.drawCircle(centerX, centerY, 29, kEyeColor);
    g_tft.fillCircle(centerX, centerY, 5, kEyeColor);
    g_tft.drawLine(centerX, centerY, centerX, centerY - 18, kEyeColor);
    g_tft.drawLine(centerX, centerY, centerX + 14, centerY + 10, kEyeColor);
    g_tft.fillCircle(centerX, centerY, 3, kBackgroundColor);
  }
}

void drawGestureIcon(int16_t centerX, int16_t centerY) {
  for (int16_t y = 0; y < kIconHeight; y++) {
    for (int16_t chunk = 0; chunk < 5; chunk++) {
      const uint16_t row = pgm_read_word(&iconGestureMaskChunks[y][chunk]);
      for (int16_t bit = 0; bit < 16; bit++) {
        if (!(row & (uint16_t(1) << bit))) continue;
        g_tft.drawPixel(centerX - kIconWidth / 2 + chunk * 16 + bit,
                        centerY - kIconHeight / 2 + y, kMenuAccentColor);
      }
    }
  }
}

const uint16_t* menuIconForIndex(uint8_t index) {
  switch (index) {
    case 0: return iconFrontHand;
    case 1: return iconFace;
    case 2: return iconPanToolAlt;
    case 3: return iconFitScreen;
    case 4: return iconSchedule;
    case 6: return iconYoutube;
    case 7: return iconSpotify;
    case 8: return iconChromium;
    default: return nullptr;
  }
}

void drawFace(bool blinking) {
  g_tft.fillScreen(kBackgroundColor);
  drawEyeShape(g_leftEyeCenterX + g_currentOffsetX, g_eyeCenterY + g_currentOffsetY,
               kEyeColor, blinking);
  drawEyeShape(g_rightEyeCenterX + g_currentOffsetX, g_eyeCenterY + g_currentOffsetY,
               kEyeColor, blinking);
  drawMouth();
}

void drawModeScreen() {
  g_tft.fillScreen(kBackgroundColor);

  drawDialogBubbleFrame(false);

  drawDialogText();

  const bool animateSpeech = g_dialogSpeaking && !g_dialogThinking;
  drawDialogFace(false, animateSpeech ? 7 : 0,
                 animateSpeech ? 6 : kMainMouthHeight);
  g_tft.setTextDatum(TL_DATUM);
}

void animateDialog() {
  const unsigned long now = millis();
  if (now - g_lastDialogFaceFrame >= 80) {
    g_lastDialogFaceFrame = now;
    const bool blinking = (now % 4200) >= 3600 && (now % 4200) < 3740;
    const bool animateSpeech = g_dialogSpeaking && !g_dialogThinking;
    const int16_t speakingMouthWidth = animateSpeech
      ? 5 + ((now / 130) % 4) * 4
      : 0;
    const int16_t speakingMouthHeight = animateSpeech
      ? 4 + ((now / 170) % 4) * 2
      : kMainMouthHeight;
    g_tft.fillRect(4, 65, g_tft.width() - 8, 78, kBackgroundColor);
    drawDialogFace(blinking, speakingMouthWidth, speakingMouthHeight);
  }

  if (g_dialogVisibleText.length() < g_statusText.length()) {
    if (now - g_dialogStartedAt < kDialogTypeIntervalMs * g_dialogVisibleText.length()) {
      g_dialogSpeaking = true;
      return;
    }
    g_dialogVisibleText = g_statusText.substring(0, g_dialogVisibleText.length() + 1);
    g_dialogSpeaking = true;
    g_dialogFinishedAt = 0;
    drawDialogBubbleFrame(true);
    drawDialogText();
    return;
  }

  if (g_dialogThinking) {
    g_dialogSpeaking = false;
    g_dialogFinishedAt = 0;
    return;
  }

  const uint16_t lastScrollOffset = g_statusText.length() > kDialogVisibleChars
      ? g_statusText.length() - kDialogVisibleChars
      : 0;
  if (g_dialogScrollOffset < lastScrollOffset) {
    if (now - g_lastDialogScrollAt < kDialogScrollIntervalMs) {
      g_dialogSpeaking = true;
      return;
    }
    g_dialogSpeaking = true;
    g_lastDialogScrollAt = now;
    g_dialogScrollOffset++;
    g_dialogFinishedAt = 0;
    drawDialogBubbleFrame(true);
    drawDialogText();
    return;
  }

  g_dialogSpeaking = false;
  g_dialogThinking = false;
  if (g_dialogFinishedAt == 0) {
    g_dialogFinishedAt = now;
  } else if (now - g_dialogFinishedAt >= kDialogHoldAfterSpeechMs) {
    g_modeScreenVisible = false;
    g_dialogVisibleText = "";
    g_dialogScrollOffset = 0;
    drawFace(g_lastBlinking);
  }
}

