tiagodnzz/zeta/esp32/src/main.cpp
void drawMenu() {
  g_tft.fillScreen(kBackgroundColor);
  g_tft.setTextDatum(MC_DATUM);
  const int16_t centerX = g_tft.width() / 2;
  const int16_t centerY = 126;
  g_tft.setTextColor(kEyeColor, kBackgroundColor);
  g_tft.setTextSize(2);
  g_tft.drawString("MENU", centerX, 18);
  g_tft.setTextSize(1);
  g_tft.drawString(String(g_menuIndex + 1) + "/" + String(kMenuItemCount), centerX, 39);

  const uint8_t visibleIndexes[4] = {
    g_menuIndex,
    static_cast<uint8_t>((g_menuIndex + 1) % kMenuItemCount),
    static_cast<uint8_t>((g_menuIndex + 2) % kMenuItemCount),
    static_cast<uint8_t>((g_menuIndex + 3) % kMenuItemCount),
  };
  const int16_t gridLeft = 22;
  const int16_t gridRight = g_tft.width() - 22;
  const int16_t gridTop = 58;
  const int16_t gridBottom = 188;
  const int16_t gridGapX = 10;
  const int16_t gridGapY = 10;
  const int16_t cardWidth = (gridRight - gridLeft - gridGapX) / 2;
  const int16_t cardHeight = (gridBottom - gridTop - gridGapY) / 2;
  const int16_t cardCentersX[4] = {
    static_cast<int16_t>(gridLeft + cardWidth / 2),
    static_cast<int16_t>(gridLeft + cardWidth + gridGapX + cardWidth / 2),
    static_cast<int16_t>(gridLeft + cardWidth / 2),
    static_cast<int16_t>(gridLeft + cardWidth + gridGapX + cardWidth / 2),
  };
  const int16_t cardCentersY[4] = {
    static_cast<int16_t>(gridTop + cardHeight / 2),
    static_cast<int16_t>(gridTop + cardHeight / 2),
    static_cast<int16_t>(gridTop + cardHeight + gridGapY + cardHeight / 2),
    static_cast<int16_t>(gridTop + cardHeight + gridGapY + cardHeight / 2),
  };
  for (uint8_t card = 0; card < 4; card++) {
    const bool selected = card == 0;
    const int16_t cardX = cardCentersX[card];
    const int16_t cardY = cardCentersY[card];
    const uint16_t color = selected ? kMenuAccentColor : kEyeColor;
    g_tft.drawRoundRect(cardX - cardWidth / 2, cardY - cardHeight / 2,
              cardWidth, cardHeight, 8, color);
    drawMenuIcon(visibleIndexes[card], cardX, cardY - 7);
    g_tft.setTextColor(color, kBackgroundColor);
    g_tft.setTextSize(1);
    g_tft.drawString(kMenuLabels[visibleIndexes[card]], cardX, cardY + 21);
  }
  g_tft.setTextColor(kMenuAccentColor, kBackgroundColor);
  g_tft.drawLine(14, centerY, 24, centerY - 6, kMenuAccentColor);
  g_tft.drawLine(14, centerY, 24, centerY + 6, kMenuAccentColor);
  g_tft.drawLine(g_tft.width() - 14, centerY, g_tft.width() - 24, centerY - 6, kMenuAccentColor);
  g_tft.drawLine(g_tft.width() - 14, centerY, g_tft.width() - 24, centerY + 6, kMenuAccentColor);
  g_tft.setTextColor(kEyeColor, kBackgroundColor);
  g_tft.setTextSize(1);
  g_tft.drawString("PUNHO CONFIRMA", centerX, 219);
  g_tft.setTextDatum(TL_DATUM);
}

void drawSystemScreen() {
  g_tft.fillScreen(kBackgroundColor);
  g_tft.setTextDatum(MC_DATUM);
  const int16_t centerX = g_tft.width() / 2;
  g_tft.setTextColor(kEyeColor, kBackgroundColor);
  g_tft.setTextSize(2);
  g_tft.drawString("SISTEMA", centerX, 24);
  g_tft.setTextSize(1);
  g_tft.setTextColor(kMenuAccentColor, kBackgroundColor);
  g_tft.drawString("CPU", 48, 78);
  g_tft.drawString(String(g_systemCpu, 1) + "%", 177, 78);
  g_tft.drawString("RAM", 48, 122);
  g_tft.drawString(String(g_systemMemory, 1) + "%", 177, 122);
  g_tft.drawString("TEMP", 48, 166);
  g_tft.drawString(g_systemTemperatureValid ? String(g_systemTemperature, 1) + " C" : "--", 177, 166);
  g_tft.setTextColor(kEyeColor, kBackgroundColor);
  g_tft.drawString("STATUS:TEXT para voltar", centerX, 228);
  g_tft.setTextDatum(TL_DATUM);
}

void drawIdleFace(int16_t eyeOffsetX, bool blinking, bool yawning, bool smiling = false) {
  g_tft.fillScreen(kBackgroundColor);
  drawEyeShape(g_leftEyeCenterX + eyeOffsetX, g_eyeCenterY, kEyeColor, blinking);
  drawEyeShape(g_rightEyeCenterX + eyeOffsetX, g_eyeCenterY, kEyeColor, blinking);

  const int16_t mouthCenterX = g_tft.width() / 2;
  const int16_t mouthY = g_eyeCenterY + kMainMouthYOffset;
  if (yawning) {
    g_tft.fillEllipse(mouthCenterX, mouthY + 3, 13, 16, kMouthColor);
  } else if (smiling) {
    for (int16_t x = -kMainMouthWidth; x <= kMainMouthWidth; x += 3) {
      const int16_t y = mouthY - (x * x) / 100;
      g_tft.fillCircle(mouthCenterX + x, y, 2, kMouthColor);
    }
  } else {
    g_tft.fillRoundRect(mouthCenterX - kMainMouthWidth, mouthY,
                        kMainMouthWidth * 2, kMainMouthHeight, 2, kMouthColor);
  }
}

void drawSleepZ(unsigned long now);

void drawSleepingFace(unsigned long now) {
  g_tft.fillScreen(kBackgroundColor);
  drawSleepingEye(g_leftEyeCenterX, g_eyeCenterY);
  drawSleepingEye(g_rightEyeCenterX, g_eyeCenterY);

  drawSleepZ(now);
}

void drawSleepZ(unsigned long now) {
  const int16_t zAreaLeft = g_leftEyeCenterX - 18;
  const int16_t zAreaTop = g_eyeCenterY - g_eyeHeight / 2 - 68;
  g_tft.fillRect(zAreaLeft - 6, zAreaTop - 4, 84, 56, kBackgroundColor);
  g_tft.setTextColor(kEyeColor, kBackgroundColor);
  g_tft.setTextSize(2);
  const int8_t zStep = (now / 180) % 18;
  for (int8_t index = 0; index < 3; index++) {
    const int16_t x = zAreaLeft + index * 22;
    const int16_t y = zAreaTop + 28 - ((zStep + index * 6) % 18) - index * 7;
    g_tft.setCursor(x, y < 2 ? 2 : y);
    g_tft.print("Z");
  }
}

void redrawEyes(bool blinking) {
  const int16_t padding = 3;
  const int16_t eyeRegionTop = g_eyeCenterY - g_maxOffset - g_eyeHeight / 2 - padding;
  const int16_t eyeRegionBottom = g_eyeCenterY + g_maxOffset + g_eyeHeight / 2 + padding;
  const int16_t eyeRegionHeight = eyeRegionBottom - eyeRegionTop;
  const int16_t eyeRegionWidth = g_tft.width() / 2 - 2 * padding;

  g_tft.fillRect(padding, eyeRegionTop, eyeRegionWidth, eyeRegionHeight, kBackgroundColor);
  g_tft.fillRect(g_tft.width() / 2 + padding, eyeRegionTop, eyeRegionWidth,
                 eyeRegionHeight, kBackgroundColor);
  drawEyeShape(g_leftEyeCenterX + g_currentOffsetX, g_eyeCenterY + g_currentOffsetY,
               kEyeColor, blinking);
  drawEyeShape(g_rightEyeCenterX + g_currentOffsetX, g_eyeCenterY + g_currentOffsetY,
               kEyeColor, blinking);
}

