tiagodnzz/zeta/esp32/src/main.cpp
void drawEyeBase() {
  const int16_t screenWidth = g_tft.width();
  const int16_t screenHeight = g_tft.height();
  const int16_t halfWidth = screenWidth / 2;

  g_eyeCenterY = screenHeight / 2 - 15;
  g_leftEyeCenterX = halfWidth - kMainEyeGap;
  g_rightEyeCenterX = halfWidth + kMainEyeGap;
  g_eyeWidth = kMainEyeRadius * 2;
  g_eyeHeight = kMainEyeRadius * 2;
  g_eyeCornerRadius = g_eyeWidth / 2;
  g_maxOffset = 12;

  drawFace(false);
}

// Desloca os dois olhos juntos proporcionalmente ao angulo (0-180, 90 = centro).
void updateEyeTarget(int xAngle, int yAngle) {
  const float normX = constrain((xAngle - 90) / 90.0f, -1.0f, 1.0f);
  const float normY = constrain((yAngle - 90) / 90.0f, -1.0f, 1.0f);
  const int16_t targetOffsetX = static_cast<int16_t>(normX * g_maxOffset);
  const int16_t targetOffsetY = static_cast<int16_t>(normY * g_maxOffset);

  // O rastreamento move apenas os servos; os olhos possuem animacao propria.
  g_currentOffsetX = 0;
  g_currentOffsetY = 0;
}

void animateFace() {
  if (g_menuVisible || g_modeScreenVisible) {
    return;
  }
  const unsigned long now = millis();
  if (now - g_lastFaceFrame < 40) {
    return;
  }
  g_lastFaceFrame = now;

  if (now - g_lastTrackingCommand < kIdleDelayMs) {
    const unsigned long blinkPosition = now % 5000;
    const bool blinking = blinkPosition >= 4200 && blinkPosition < 4350;
    if (blinking != g_lastBlinking) {
      g_lastBlinking = blinking;
      drawFace(blinking);
    }
    return;
  }

  const unsigned long idlePosition = (now - g_lastTrackingCommand) % kIdleCycleMs;
  int8_t phase = 0;
  if (idlePosition >= 2200 && idlePosition < 4600) {
    phase = 1;
  } else if (idlePosition >= 4600 && idlePosition < 5200) {
    phase = 2;
  } else if (idlePosition >= 5200 && idlePosition < 5600) {
    phase = 3;
  } else if (idlePosition >= 5600 && idlePosition < 8000) {
    phase = 4;
  } else if (idlePosition >= 8000 && idlePosition < 8600) {
    phase = 5;
  } else if (idlePosition >= 8600 && idlePosition < 10100) {
    phase = 6;
  } else if (idlePosition >= 10100 && idlePosition < 11000) {
    phase = 7;
  } else if (idlePosition >= 11000 && idlePosition < 12000) {
    phase = 8;
  } else if (idlePosition >= 12000 && idlePosition < 21000) {
    phase = 9;
  } else {
    phase = 10;
  }

  if (phase == g_idlePhase) {
    if (phase == 9 && now - g_lastZFrame >= 180) {
      g_lastZFrame = now;
      drawSleepZ(now);
    }
    return;
  }
  g_idlePhase = phase;

  if (phase == 1) {
    g_currentOffsetX = g_maxOffset * 0.7f;
    drawIdleFace(g_currentOffsetX, false, false);
  } else if (phase == 2) {
    g_currentOffsetX = 0;
    drawIdleFace(0, false, false);
  } else if (phase == 3) {
    drawIdleFace(0, true, false);
  } else if (phase == 4) {
    g_currentOffsetX = -g_maxOffset * 0.7f;
    drawIdleFace(g_currentOffsetX, false, false);
  } else if (phase == 5) {
    g_currentOffsetX = 0;
    drawIdleFace(0, false, false);
  } else if (phase == 6) {
    drawIdleFace(0, false, true);
  } else if (phase == 7) {
    drawIdleFace(0, false, false, true);
  } else if (phase == 8) {
    drawSleepingFace(now);
  } else if (phase == 9) {
    drawSleepingFace(now);
  } else if (phase == 10) {
    g_currentOffsetX = 0;
    drawIdleFace(0, false, false, true);
  } else {
    g_currentOffsetX = 0;
    drawIdleFace(0, false, false);
  }
}

void processCommand(String line) {
  line.trim();

  if (line == "MODE:MENU") {
    g_menuVisible = true;
    g_modeScreenVisible = false;
    g_systemScreenVisible = false;
    g_menuIndex = 1;
    g_idlePhase = -1;
    drawMenu();
    return;
  }
  if (line == "MODE:FACE") {
    g_menuVisible = false;
    g_modeScreenVisible = false;
    g_systemScreenVisible = false;
    drawFace(g_lastBlinking);
    return;
  }
  if (line.startsWith("MODE:")) {
    g_menuVisible = false;
    g_modeScreenVisible = true;
    g_systemScreenVisible = false;
    const String mode = line.substring(5);
    if (mode == "FOLLOW_HAND") g_menuIndex = 0;
    else if (mode == "FOLLOW_FACE") g_menuIndex = 1;
    else if (mode == "COUNT_FINGERS") g_menuIndex = 2;
    else if (mode == "OBJECT_DETECTION") g_menuIndex = 3;
    else if (mode == "DATE_TIME") g_menuIndex = 4;
    else if (mode == "DRAWING") g_menuIndex = 5;
    else if (mode == "YOUTUBE") g_menuIndex = 6;
    else if (mode == "SPOTIFY") g_menuIndex = 7;
    else if (mode == "BROWSER") g_menuIndex = 8;
    else if (mode == "SYSTEM") g_menuIndex = 9;
    g_statusText = "Ativo";
    drawModeScreen();
    return;
  }
  if (line == "SCREEN:SYSTEM") {
    g_menuVisible = false;
    g_modeScreenVisible = false;
    g_systemScreenVisible = true;
    drawSystemScreen();
    return;
  }
  if (line.startsWith("SYSTEM:CPU:")) {
    const int firstSeparator = line.indexOf(':', 11);
    const int secondSeparator = line.indexOf(':', firstSeparator + 1);
    if (firstSeparator > 0 && secondSeparator > firstSeparator) {
      g_systemCpu = line.substring(11, firstSeparator).toFloat();
      g_systemMemory = line.substring(firstSeparator + 1, secondSeparator).toFloat();
      const String temperature = line.substring(secondSeparator + 1);
      g_systemTemperatureValid = temperature != "--";
      g_systemTemperature = temperature.toFloat();
      if (g_systemScreenVisible) drawSystemScreen();
    }
    return;
  }
  if (line.startsWith("STATUS:TEXT:")) {
    const String newStatusText = line.substring(12);
    if (newStatusText == g_statusText) {
      return;
    }
    g_statusText = newStatusText;
    g_dialogVisibleText = "";
    g_dialogStartedAt = millis();
    g_dialogScrollOffset = 0;
    g_lastDialogScrollAt = 0;
    g_dialogFinishedAt = 0;
    g_dialogSpeaking = true;
    g_dialogThinking = newStatusText == "Pensando...";
    if (!g_menuVisible) {
      g_modeScreenVisible = true;
      drawModeScreen();
    }
    return;
  }
  if (line.startsWith("STATUS:FINGERS:")) {
    g_statusText = "Dedos: " + line.substring(15);
    g_dialogVisibleText = "";
    g_dialogStartedAt = millis();
    g_dialogScrollOffset = 0;
    g_lastDialogScrollAt = 0;
    g_dialogFinishedAt = 0;
    g_dialogSpeaking = true;
    g_dialogThinking = false;
    if (!g_menuVisible) {
      g_modeScreenVisible = true;
      drawModeScreen();
    }
    return;
  }
  if (line.startsWith("MENU:INDEX:")) {
    const int index = line.substring(11).toInt();
    if (index >= 0 && index < kMenuItemCount) {
      g_menuIndex = static_cast<uint8_t>(index);
      if (g_menuVisible) {
        drawMenu();
      }
    }
    return;
  }
  if (line == "MENU:CONFIRM") {
    Serial.print("OK MENU:");
    Serial.println(kMenuLabels[g_menuIndex]);
    return;
  }
  if (line == "MENU:CANCEL") {
    g_menuVisible = false;
    g_modeScreenVisible = false;
    g_systemScreenVisible = false;
    drawFace(g_lastBlinking);
    return;
  }

