tiagodnzz/zeta/esp32/src/main.cpp
  g_lastTrackingCommand = millis();
  g_idlePhase = -1;

  if (line == "OFF") {
    g_servoX.detach();
    g_servoY.detach();
    updateEyeTarget(90, 90);
    Serial.println("OK OFF");
    return;
  }

  const int commaIdx = line.indexOf(',');
  if (commaIdx < 0) {
    return;
  }

  const String xPart = line.substring(0, commaIdx);
  const String yPart = line.substring(commaIdx + 1);

  const int xColon = xPart.indexOf(':');
  const int yColon = yPart.indexOf(':');
  if (xColon < 0 || yColon < 0) {
    return;
  }

  int xAngle = xPart.substring(xColon + 1).toInt();
  int yAngle = yPart.substring(yColon + 1).toInt();

  xAngle = constrain(xAngle, 0, 180);
  yAngle = constrain(yAngle, 0, 180);

  attachIfNeeded();
  g_servoX.write(xAngle);
  g_servoY.write(yAngle);
  updateEyeTarget(xAngle, yAngle);

  Serial.print("OK X:");
  Serial.print(xAngle);
  Serial.print(" Y:");
  Serial.println(yAngle);
}

}  // namespace

void setup() {
  Serial.begin(115200);

  g_tft.init();
  g_tft.setRotation(kScreenRotation);
  drawEyeBase();
  updateEyeTarget(90, 90);

  // Timers dedicados do LEDC para os servos (PWM 100% em hardware)
  ESP32PWM::allocateTimer(0);
  ESP32PWM::allocateTimer(1);

  g_servoX.setPeriodHertz(50);
  g_servoY.setPeriodHertz(50);

  g_servoX.attach(kPinServoX, kPulseMinUs, kPulseMaxUs);
  g_servoY.attach(kPinServoY, kPulseMinUs, kPulseMaxUs);

  g_servoX.write(90);
  g_servoY.write(90);

  Serial.println("ESP32 servo controller pronto.");
}

void loop() {
  animateFace();
  if (g_modeScreenVisible) {
    animateDialog();
  }
  while (Serial.available()) {
    const char c = static_cast<char>(Serial.read());
    if (c == '\n') {
      processCommand(g_inputLine);
      g_inputLine = "";
    } else if (c != '\r') {
      g_inputLine += c;
    }
  }
}